Revit 2027 API
IFCOpeningData.OpeningElementId Property
 The opening element id.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId OpeningElementId { get; }
Public ReadOnly Property OpeningElementId As ElementId
	Get
public:
property ElementId^ OpeningElementId {
	ElementId^ get ();
}
member OpeningElementId : ElementId with get
Property Value
ElementId
See Also
Reference
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace